import { Container, Title, HeroText, ItemText, TitleDynamic, Text } from './HeroSection.styled';

export default function HeroSection() {
  return (
    <Container>
      <Title>Вітаємо в Matrix Create!</Title>
      <HeroText>
        Наш додаток створює матрицю розмірністю <ItemText>М (кількість рядків) </ItemText>
        на <ItemText>N (кількість колонок)</ItemText>. Місце перетину колонки і рядка - це
        згенероване трьохзначне число від 0 до 999.
      </HeroText>
      <TitleDynamic>Підключена динаміка комірок і рядків матриці:</TitleDynamic>
      <ul>
        <li>
          <Text>
            При натисканні на комірку збільшується значення комірки на +1 і відповідно змінюється
            середнє значення колонки матриці і сума цього рядка.
          </Text>
        </li>
        <li>
          <Text>
            При наведенні мишкою на одну комірку таблиці підсвічується{' '}
            <ItemText>Х-діапазон (кількість комірок)</ItemText>, значення яких найближче до значення
            поточної комірки.
          </Text>
        </li>
        <li>
          <Text>
            При наведенні на комірку суми по рядку змінюється значення суми на відсоток їхнього
            вкладу в загальну суму, відповідно додається фон - стовпчик, який покаже величину
            відсотка.
          </Text>
        </li>
        <li>
          <Text>
            Реалізована можливість видалити рядок з таблиці, при цьому змінюються середні значення
            по кожному стовпчику матриці.
          </Text>
        </li>
        <li>
          <Text>
            Реалізована можливість додати рядок до таблиці. При цьому рядок заповнюється за всіма
            вище переліченими правилами.
          </Text>
        </li>
      </ul>
    </Container>
  );
}
